Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: One of the problems for Vim novices is mode confusion, which is caused by forgetting which mode you are in or by accidentally typing a command that switches modes.
es_es: Uno de los problemas para los que comienzan a usar Vim es la confusión de los modos, que se produce al olvidar en qué modo está o por teclear accidentalmente una orden que cambia de modo.

source: To get back to Normal mode, no matter what mode you are in, press the <Esc> key.
es_es: Para volver al modo Normal, no importa el modo en el que esté,presione la tecla <Esc>.

source: Sometimes you have to press it twice.
es_es: En algunas ocasiones, tendrá que presionarlo dos veces.

source: If Vim beeps back at you, you already are in Normal mode.
es_es: Si Vim emite un pitido, entonces es que está de vuelta al modo Normal.

source: At first, it may appear that these commands were chosen at random.
es_es: En un principio, puede parecer que estas órdenes se han elegido arbitrariamente.

source: After all, who ever heard of using l for right?
es_es: Después de todo, ¿quién ha visto usar l para derecha?

source: But actually, there is a very good reason for these choices: Moving the cursor is the most common thing you do in an editor, and these keys are on the home row of your right hand.
es_es: De hecho, hay una buena razón para esto: mover el cursor es una de las cosas más comunes que hará en un editor, y estas teclas están en la fila central de su mano derecha.

source: In other words, these commands are placed where you can type them the fastest (especially when you type with ten fingers).
es_es: En otras palabras, estas órdenes se sitúan donde puede teclearlos de manera más rápida (especialmente cuando escribe con diez dedos).

source: Note: You can also move the cursor by using the arrow keys.
es_es: Nota: También puede mover el cursor usando las flechas.

source: If you do, however, you greatly slow down your editing because to press the arrow keys, you must move your hand from the text keys to the arrow keys.
es_es: Si lo haces, sin embargo, ralentizará considerablemente la edición, ya que para ello tendrá que desplazar su mano desde las letras a las flechas del teclado.

source: Considering that you might be doing it hundreds of times an hour, this can take a significant amount of time.
es_es: Teniendo en cuenta que debe hacerlo cientos de veces cada hora, esto puede llevar un tiempo considerable.

source: Also, there are keyboards which do not have arrow keys, or which locate them in unusual places; therefore, knowing the use of the hjkl keys helps in those situations.
es_es: Además, hay teclados que no tienen teclas de flechas, o que las colocan en lugares inusuales; por lo tanto, conocer el uso de hjkl ayuda en esas situaciones.

source: One way to remember these commands is that h is on the left, l is on the right and j points down.
es_es: Una manera de recordar estas órdenes es que la h está a la izquierda, l en la derecha y j apunta hacia abajo.

source: In a picture: >
es_es: En un esquema: >

source: The best way to learn these commands is by using them.
es_es: La mejor manera de aprender estas órdenes es usándolas.

source: Use the "i" command to insert some more lines of text.
es_es: Use la orden «i» para insertar algunas líneas de texto más.

source: Then use the hjkl keys to move around and insert a word somewhere.
es_es: Use entonces las teclas hjkl para moverse e insertar palabras.

source: Don't forget to press <Esc> to go back to Normal mode.
es_es: No se olvide de presionar <Esc> para volver al modo Normal.

source: The |vimtutor| is also a nice way to learn by doing.
es_es: El |vimtutor| es también una práctica manera de aprender.

source: To delete a character, move the cursor over it and type "x".
es_es: Para eliminar un carácter, sitúe el cursor encima de él y presione «x».

source: (This is a throwback to the old days of the typewriter, when you deleted things by typing xxxx over them.) Move the cursor to the beginning of the first line, for example, and type xxxxxxx (seven x's) to delete "A very ".
es_es: (Esto es una reminiscencia de los días de las máquinas de escribir, cuando se eliminaban caracteres escribiendo xxxx sobre ellos.) Sitúe el cursor al comienzo de la primera línea, por ejemplo, y pulse xxxxxxx (siete «xx») para eliminar «A very».

source: The result should look like this:
es_es: El resultado debería ser:

source: This begins an insert (the i), inserts the words "A young", and then exits insert mode (the final <Esc>).
es_es: Esto inicia una inserción (la «i»), inserta las palabras «A young», y sale del modo insertar (el <Esc> final).

source: To delete a whole line use the "dd" command.
es_es: Para eliminar una línea entera use la orden «dd».

source: The following line will then move up to fill the gap:
es_es: La siguiente línea se moverá hacia arriba para rellenar el hueco:

source: In Vim you can join two lines together, which means that the line break between them is deleted.
es_es: En Vim puede unir dos líneas, lo que significa que el salto de línea entre ellas se elimina.

source: The "J" command does this.
es_es: La orden «J» hace esto.

source: Take these two lines:
es_es: Suponga estas dos líneas:

source: Suppose you delete too much.
es_es: Suponga que elimina demasiado.

source: Well, you can type it in again, but an easier way exists.
es_es: Puede teclearlo de nuevo, pero existe una manera más fácil.

source: The "u" command undoes the last edit.
es_es: La orden «u» deshace la última edición.

source: Take a look at this in action: After using "dd" to delete the first line, "u" brings it back.
es_es: Vea esto en acción: Tras usar «dd» para eliminar la última línea, «u» la devuelve.

source: Another one: Move the cursor to the A in the first line:
es_es: Otra más: mueve el cursor a la A en la primera línea:

source: Now type xxxxxxx to delete "A young".
es_es: Ahora teclee xxxxxxx para eliminar «A young».

source: Type "u" to undo the last delete.
es_es: Teclee «u» para deshacer la última eliminación.

source: That delete removed the g, so the undo restores the character.
es_es: Esa última eliminación quitó la g, por lo que deshacer la devuelve.

source: Note: If you type "u" twice, and the result is that you get the same text back, you have Vim configured to work Vi compatible.
es_es: Nota: Si teclea la «u» dos veces, y el resultado que obtendrá es el mismo texto de vuelta, es que tiene Vim configurado para que sea Vi-compatible.

source: Look here to fix this: |not-compatible|.
es_es: Véase aquí para solucionarlo: |not-compatible|.

source: This text assumes you work "The Vim Way".
es_es: Este texto asume que trabaja en «El Modo Vim».

source: You might prefer to use the good old Vi way, but you will have to watch out for small differences in the text then.
es_es: Quizá quiera usar el viejo modo Vi, pero entonces tendrá que observar las pequeñas diferencias.

source: If you undo too many times, you can press CTRL-R (redo) to reverse the preceding command.
es_es: Si deshace de más, puede pulsar CTRL-R (rehacer) para revertir la orden precedente.

source: In other words, it undoes the undo.
es_es: En otras palabras, deshace el deshacer.

source: To see this in action, press CTRL-R twice.
es_es: Para ver esto en acción, presione CTRL-R dos veces.

source: The character A and the space after it disappear:
es_es: El carácter A y el espacio desaparecerían:

source: There's a special version of the undo command, the "U" (undo line) command.
es_es: Hay una versión especial de la orden deshacer, la orden «U» (deshacer línea).

source: The undo line command undoes all the changes made on the last line that was edited.
es_es: La orden deshacer línea deshace todos los cambios realizados en la última línea editada.

source: Typing this command twice cancels the preceding "U".
es_es: Si teclea esta orden dos veces, deshará la «U» precedente.

source: The "U" command is a change by itself, which the "u" command undoes and CTRL-R redoes.
es_es: La orden «U» es un cambio en sí mismo, que la orden «u» deshace y CTRL-R rehace.

source: This might be a bit confusing.
es_es: Esto puede resultar confuso.

source: Don't worry, with "u" and CTRL-R you can go to any of the situations you had.
es_es: No se preocupe, con «u» y CTRL-R puede ir a cualquier situación anterior.

source: More about that in section |32.2|.
es_es: Más información en la sección |32.2|.

source: Vim has a large number of commands to change the text.
es_es: Vim tiene una larga lista de órdenes para modificar texto.

source: See |Q_in| and below.
es_es: Véase |Q_in| y a continuación.

source: Here are a few often used ones.
es_es: Aquí hay algunos de uso frecuente.

source: The "i" command inserts a character before the character under the cursor.
es_es: La orden «i» inserta un carácter antes del carácter bajo el cursor.

source: That works fine; but what happens if you want to add stuff to the end of the line?
es_es: Esto funciona bien; pero ¿qué ocurre si quieres añadir algo al final de la línea?

source: For that you need to insert text after the cursor.
es_es: Para ello necesita insertar texto después del cursor.

source: This is done with the "a" (append) command.
es_es: Esto se hace con la orden «a» (añadir).

source: For example, to change the line
es_es: Por ejemplo, para modificar la línea

source: ~ to and that's not saying much for the turtle!!!
es_es: ~ a and that's not saying much for the turtle!!!

source: The "o" command creates a new, empty line below the cursor and puts Vim in Insert mode.
es_es: La orden «o» crea una nueva línea vacía debajo del cursor y pone Vim en modo insertar.

source: Then you can type the text for the new line.
es_es: Puede introducir el texto de la nueva línea.

source: Suppose the cursor is somewhere in the first of these two lines:
es_es: Suponga que el cursor está en algún lugar de la primera de estas líneas:

source: Suppose you want to move up nine lines.
es_es: Suponga que quiera desplazarse nueve líneas hacia arriba.

source: You can type "kkkkkkkkk" or you can enter the command "9k".
es_es: Puede teclear «kkkkkkkkk» o puede teclear la orden «9k».

source: In fact, you can precede many commands with a number.
es_es: De hecho, se puede emplear el multiplicador con muchas órdenes.

source: Earlier in this chapter, for instance, you added three exclamation points to the end of a line by typing "a!!!<Esc>".
es_es: Anteriormente en este capítulo, añadió tres exclamaciones al final de la línea con «a!!!<Esc>».

source: Another way to do this is to use the command "3a!<Esc>".
es_es: Otra forma de hacer esto es usar la orden «3a!<Esc>».

source: The count of 3 tells the command that follows to triple its effect.
es_es: El multiplicador 3 hace que la orden a continuación triplique su efecto.

source: Similarly, to delete three characters, use the command "3x".
es_es: De igual modo, para eliminar tres caracteres, use «3x».

source: The count always comes before the command it applies to.
es_es: El multiplicador siempre va delante de la orden sobre el que se aplica.

source: To exit, use the "ZZ" command.
es_es: Para salir, use la orden «ZZ».

source: This command writes the file and exits.
es_es: Esta orden escribe el archivo y sale.

source: Note: Unlike many other editors, Vim does not automatically make a backup file.
es_es: Nota: Al revés que muchos otros editores, Vim no hace un archivo de seguridad automático.

source: If you type "ZZ", your changes are committed and there's no turning back.
es_es: Si escribe «ZZ», sus cambios se comprometen sin vuelta atrás.

source: You can configure the Vim editor to produce backup files, see |07.4|.
es_es: Puede configurar el editor Vim para que haga copias de seguridad, consulte |07.4|.

source: Sometimes you will make a sequence of changes and suddenly realize you were better off before you started.
es_es: En ocasiones se dará cuenta de que tras una serie de cambios, estaba mejor donde comenzó.

source: Not to worry; Vim has a quit-and-throw-things-away command.
es_es: No se preocupe; Vim tiene una orden para salir y descartar todos los cambios.

source: It is: >
es_es: Es: >

source: For those of you interested in the details, the three parts of this command are the colon (:), which enters Command-line mode; the q command, which tells the editor to quit; and the override command modifier (!).
es_es: Para aquellos de vosotros interesados en los detalles, las tres partes de esta orden son los dos puntos (:), que entra en el modo en línea de órdenes; la orden «q», para salir; y el modificador de anulación (!).

source: The override command modifier is needed because Vim is reluctant to throw away changes.
es_es: El modificador de anulación es necesario porque Vim se resiste a perder los cambios.

source: If you were to just type ":q", Vim would display an error message and refuse to exit:
es_es: Si escribiese sólo «:q», Vim mostraría un mensaje de error y se negaría a salir:

source: Everything you always wanted to know can be found in the Vim help files.
es_es: Todo lo que quiera saber puede encontrarlo en los archivos de ayuda.

source: Don't be afraid to ask!
es_es: ¡No tenga miedo a preguntar!

source: To get generic help use this command: >
es_es: Use la siguiente orden para obtener ayuda genérica:

source: You could also use the first function key <F1>.
es_es: También puede usar la tecla <F1>.

source: If your keyboard has a <Help> key it might work as well.
es_es: Si su teclado tiene tecla <Ayuda> puede que funcione también.

source: If you don't supply a subject, ":help" displays the general help window.
es_es: Si no define un tema, «:help» muestra la ventana de ayuda general.

source: The creators of Vim did something very clever (or very lazy) with the help system: They made the help window a normal editing window.
es_es: Los creadores de Vim hicieron algo muy inteligente (o fueron muy vagos) con el sistema de ayuda: Hicieron la ventana de ayuda una ventana normal de edición.

source: You can use all the normal Vim commands to move through the help information.
es_es: Puede usar todas las órdenes comunes de Vim para moverse por ella.

source: Therefore h, j, k, and l move left, down, up and right.
es_es: Por lo tanto, h, j, k, l mueven el cursor hacia la izquierda, derecha, arriba y abajo.

source: To get out of the help window, use the same command you use to get out of the editor: "ZZ".
es_es: Para salir de la ventana de ayuda, usa la misma orden que usas para salir del editor: «ZZ».

source: This will only close the help window, not exit Vim.
es_es: Esto sólo cierra la ayuda, no sale de Vim.

source: When you need to get help for a control character command (for example, CTRL-A), you need to spell it with the prefix "CTRL-".
es_es: Cuando necesite obtener ayuda para las órdenes de control de carácter (por ejemplo, CTRL-A), debe escribirlo con el prefijo «CTRL-».

source: The Vim editor has many different modes.
es_es: El editor Vim tiene muchos modos diferentes.

source: By default, the help system displays the normal-mode commands.
es_es: De manera predeterminada, el sistema de ayuda muestra las ordenes del modo normal.

source: For example, the following command displays help for the normal-mode CTRL-H command: >
es_es: Por ejemplo, la siguiente orden muestra la ayuda para la orden CTRL-H en modo normal: >

source: To identify other modes, use a mode prefix.
es_es: Para identificar otros modos, se necesita un prefijo de modo.

source: If you want the help for the insert-mode version of a command, use "i_".
es_es: Si quiere ayuda para la versión en modo Insertar de una orden, use «i_».

source: For CTRL-H this gives you the following command: >
es_es: Para, CTRL-H es la siguiente orden: >

source: The Vim editor has a number of options that enable you to configure and customize the editor.
es_es: El editor Vim tiene una serie de opciones que le permiten configurar y personalizar el editor.

source: If you want help for an option, you need to enclose it in single quotation marks.
es_es: Si quiere ayuda para una opción, tiene que escribirla entre comillas simples.

source: To find out what the 'number' option does, for example, use the following command: >
es_es: Para encontrar lo que hace la opción 'number' por ejemplo, usa la orden siguiente: >

source: Special keys are enclosed in angle brackets.
es_es: Las teclas especiales se escriben entre corchetes angulares.

source: To find help on the up-arrow key in Insert mode, for instance, use this command: >
es_es: Para encontrar ayuda sobre la flecha hacia arriba en modo insertar, use: >

source: *intro.txt* For Vim version 7.3.
es_es: *intro.esx* Para Vim versión 7.3.

source: Introduction |intro| 2.
es_es: Introducción |intro| 2.

source: Vim on the internet |internet| 3.
es_es: Vim en internet |internet| 3.

source: Credits |credits| 4.
es_es: Créditos |credits| 4.

source: Notation |notation| 5.
es_es: Notación |notación| |notation| 5.

source: Modes, introduction |vim-modes-intro| 6.
es_es: Modos, introducción |vim-modes-intro| 6.

source: Switching from mode to mode |mode-switching| 7.
es_es: Cambiar de Modos |cambiar-modo| |mode-switching| 7.

source: The window contents |window-contents| 8.
es_es: El contenido de la ventana |ventana-contenidos| |window-contents| 8.

source: Definitions |definitions|
es_es: Definiciones |definiciones| |definitions|

source: Introduction *intro*
es_es: Introducción *intro*

source: Vim stands for Vi IMproved.
es_es: Vim son las siglas de Vi Improved («Vi mejorado»).

source: It used to be Vi IMitation, but there are so many improvements that a name change was appropriate.
es_es: Solía significar Vi IMitation, pero hay tantas mejoras que se consideró apropiado cambiar el nombre.

source: Vim is a text editor which includes almost all the commands from the Unix program "Vi" and a lot of new ones.
es_es: Vim es un editor de texto que incluye casi todas las órdenes del programa para Unix, Vi, así como otras más.

source: It is very useful for editing programs and other plain text.
es_es: Es muy útil para la edición de programas y archivos de formato de texto normal.

source: All commands are given with the keyboard.
es_es: Todas las órdenes se introducen mediante el teclado.

source: This has the advantage that you can keep your fingers on the keyboard and your eyes on the screen.
es_es: Ésto ofrece la ventaja de poder tener sus dedos en el teclado y sus ojos en la pantalla.

source: For those who want it, there is mouse support and a GUI version with scrollbars and menus (see |gui.txt|).
es_es: Para aquellos que lo deseen, también tiene compatibilidad con ratón y una versión que ofrece una interfaz gráfica con barras de desplazamiento y menús (consulte |gui.txt|).

source: An overview of this manual can be found in the file "help.txt", |help.txt|.
es_es: Encontrará una visión general de este manual en el archivo «help.txt», |help.txt|.

source: It can be accessed from within Vim with the <Help> or <F1> key and with the |:help| command (just type ":help", without the bars or quotes).
es_es: Puede acceder a él a través de Vim con la tecla <Ayuda> o <F1> y con la orden |:help| (sólo teclee «:help», sin las comillas o barras).

source: The 'helpfile' option can be set to the name of the help file, in case it is not located in the default place.
es_es: La opción 'helpfile' se puede configurar con el nombre del archivo de ayuda en caso de no encontrarse en la ubicación habitual.

source: You can jump to subjects like with tags: Use CTRL-] to jump to a subject under the cursor, use CTRL-T to jump back.
es_es: Puede saltar de un tema a otro como si fuesen etiquetas: Use CTRL-] para pasar al tema bajo el cursor, y CTRL-T para volver.

source: Throughout this manual the differences between Vi and Vim are mentioned in curly braces, like this: {Vi does not have on-line help}.
es_es: Las diferencias entre Vi y Vim se señalarán con llaves, por ejemplo: {Vi no tiene ayuda en línea}.

source: See |vi_diff.txt| for a summary of the differences between Vim and Vi.
es_es: Consulte |vi_diff.txt| para un resumen de las diferencias entre Vim y Vi.

source: This manual refers to Vim on various machines.
es_es: Este manual trata el uso de Vim en varios sistemas.

source: There may be small differences between different computers and terminals.
es_es: Pueden existir pequeñas diferencias entre computadoras y terminales.

source: Besides the remarks given in this document, there is a separate document for each supported system, see |sys-file-list|.
es_es: Además de los comentarios que se ofrecen en este documento, hay un documento aparte para cada sistema compatible, consulte |sys-file-list|.

source: *pronounce* Vim is pronounced as one word, like Jim, not vi-ai-em.
es_es: *pronounce* *pronunciar* Vim se pronuncia como una sola palabra, como Jim, no uve-a-eme.

source: It's written with a capital, since it's a name, again like Jim.
es_es: Se escribe mayúscula, ya que es un nombre al igual que Jim.

source: This manual is a reference for all the Vim commands and options.
es_es: Este manual es una referencia para todas las órdenes y opciones de Vim.

source: This is not an introduction to the use of Vi or Vim, it gets a bit complicated here and there.
es_es: No es una introducción al uso de Vi o Vim, y algunas secciones son complejas.

source: For beginners, there is a hands-on |tutor|.
es_es: Hay un tutor práctico, |tutor|.

source: To learn using Vim, read the user manual |usr_toc.txt|.
es_es: Si quiere aprender a usar Vim, consulte el manual de usuario |usr_toc.txt|.

source: *book* There are many books on Vi that contain a section for beginners.
es_es: *book* Existen muchos libros sobre Vi que contienen una sección para principiantes.

source: There are two books I can recommend:
es_es: Personalmente recomiendo dos libros:

source: This is the very first book completely dedicated to Vim.
es_es: Este es el primer libro completamente dedicado a Vim.

source: It is very good for beginners.
es_es: Es muy bueno para principiantes.

source: The most often used commands are explained with pictures and examples.
es_es: Las órdenes más usadas se explican con imágenes y ejemplos.

source: The less often used commands are also explained, the more advanced features are summarized.
es_es: También se tratan aquellas órdenes menos comunes, y las características más avanzadas son resumidas.

source: There is a comprehensive index and a quick reference.
es_es: Tiene un completo índice y una rápida referencia.

source: Parts of this book have been included in the user manual |frombook|.
es_es: Hay partes de este libro incluidas en el manual de usuario |frombook|.

source: Published by New Riders Publishing.
es_es: Publicado por New Riders Publishing.

source: ISBN: 0735710015 For more information try one of these: http://iccf-holland.org/click5.html http://www.vim.org/iccf/click5.html
es_es: ISBN: 0735710015 Pruebe estos enlaces para más información: http://iccf-holland.org/click5.html http://www.vim.org/iccf/click5.html

source: Vim on the internet *internet*
es_es: Vim en internet *internet*

source: *www* *WWW* *faq* *FAQ* *distribution* *download* The Vim pages contain the most recent information about Vim.
es_es: *www* *WWW* *faq* *FAQ* *distribution* *download* *descargar* Las páginas de Vim ofrecen la información más actualizada.

source: They also contain links to the most recent version of Vim.
es_es: También contienen enlaces a la versión más reciente de Vim.

source: The FAQ is a list of Frequently Asked Questions.
es_es: El FAQ es una lista de las preguntas más frecuentes.

source: Read this if you have problems.
es_es: Consulte esa página en caso de tener problemas.
